In [1]:
import pandas as pd
import datetime

df = pd.read_csv("operations.csv",sep = ";",index_col=None)
df

,date,asset,qtd bought,qtd sold,unit value,value bought,value sold
0,19/02/2021,PETR3,200,0,27.19,5438.0,0.0
1,19/02/2021,PETR3,100,0,27.19,2719.0,0.0
2,19/02/2021,PETRC300,0,300,0.47,0.0,141.0
3,22/02/2021,PETRC300,300,0,0.09,27.0,0.0
4,13/01/2021,VVARN120,1000,0,0.11,110.0,0.0
5,20/01/2021,VVARB170,1000,0,0.10,100.0,0.0
6,29/01/2021,VVARB170,0,1000,0.21,0.0,210.0
7,29/01/2021,VVARN120,0,1000,0.09,0.0,90.0

In [2]:
dates = df["date"]
dates

0    19/02/2021
1    19/02/2021
2    19/02/2021
3    22/02/2021
4    13/01/2021
5    20/01/2021
6    29/01/2021
7    29/01/2021
Name: date, dtype: object

In [3]:
# esse eh o melhor jeito de fazer a transformação ?
data = []
for index, value in dates.items():
    date = datetime.datetime.strptime(value, "%d/%m/%Y")
    data.append(date.month)    
month_dates = pd.Series(data)
month_dates

0    2
1    2
2    2
3    2
4    1
5    1
6    1
7    1
dtype: int64

In [33]:
# como fazer sem alterar o original? querua ter df_opertions_by_month
df["date"] = month_dates
df

   date     asset  qtd bought  qtd sold  unit value  value bought  value sold
0     2     PETR3         200         0       27.19        5438.0         0.0
1     2     PETR3         100         0       27.19        2719.0         0.0
2     2  PETRC300           0       300        0.47           0.0       141.0
3     2  PETRC300         300         0        0.09          27.0         0.0
4     1  VVARN120        1000         0        0.11         110.0         0.0
5     1  VVARB170        1000         0        0.10         100.0         0.0
6     1  VVARB170           0      1000        0.21           0.0       210.0
7     1  VVARN120           0      1000        0.09           0.0        90.0

In [26]:
df_group_by_month =  df.groupby(["date","asset"]).sum()
df_group_by_month.head()

               qtd bought  qtd sold  unit value  value bought  value sold
date asset
1    VVARB170        1000      1000        0.31         100.0       210.0
     VVARN120        1000      1000        0.20         110.0        90.0
2    PETR3            300         0       54.38        8157.0         0.0
     PETRC300         300       300        0.56          27.0       141.0

In [34]:
df_group_by_month["total"] = df_group_by_month.apply(lambda row: row["value sold"] - row["value bought"], axis=1)
df_group_by_month

               qtd bought  qtd sold  unit value  value bought  value sold  \
date asset
1    VVARB170        1000      1000        0.31         100.0       210.0
     VVARN120        1000      1000        0.20         110.0        90.0
2    PETR3            300         0       54.38        8157.0         0.0
     PETRC300         300       300        0.56          27.0       141.0

                total
date asset
1    VVARB170   110.0
     VVARN120   -20.0
2    PETR3    -8157.0
     PETRC300   114.0

In [30]:
data = []
#assets = df_group_by_month["asset"]
for index, value in df_group_by_month.items():
    #data.append()
    print(value)

date  asset
1     VVARB170    1000
      VVARN120    1000
2     PETR3        300
      PETRC300     300
Name: qtd bought, dtype: int64
date  asset
1     VVARB170    1000
      VVARN120    1000
2     PETR3          0
      PETRC300     300
Name: qtd sold, dtype: int64
date  asset
1     VVARB170     0.31
      VVARN120     0.20
2     PETR3       54.38
      PETRC300     0.56
Name: unit value, dtype: float64
date  asset
1     VVARB170     100.0
      VVARN120     110.0
2     PETR3       8157.0
      PETRC300      27.0
Name: value bought, dtype: float64
date  asset
1     VVARB170    210.0
      VVARN120     90.0
2     PETR3         0.0
      PETRC300    141.0
Name: value sold, dtype: float64